# Markdown 基本语法测试

## 1 标题
### 1.1 这是一个三级标题
#### 1.1.1 这是一个四级标题
##### 1.1.1.1 这是一个五级标题
###### 1.1.1.1.1 这是一个六级标题

## 2 列表

+ 无序列表
+ 无序列表
+ 无序列表

1. 有序列表
2. 有序列表
3. 有序列表

1. 有序列表
   1. 有序列表
      - 无序列表
      - 无序列表
   2. 有序列表
2. 有序列表

## 3 引用

> 我们一直寻找的，却是自己原本早已拥有的；我们总是东张西望，唯独漏了自己想要的，这就是我们至今难以如愿以偿的原因。——柏拉图

## 4 字体

+ 倾斜：*智者说话，是因为他们有话要说；愚者说话，则是因为他们想说。*

+ 加粗：**人生最遗憾的，莫过于轻易地放弃了不该放弃的，固执地坚持了不该坚持的。**

+ 倾斜并加粗：***没有经历过爱情的人生是不完整的，没有经历过痛苦的爱情是不深刻的。爱情使人生丰富，痛苦使爱情升华。***

## 5 表格

| Python | C          | C++    |
| ------ | ---------- | ------ |
| Rust   | R          | Ruby   |
| Java   | JavaScript | Lua    |
| MATLAB | Scipy      | OpenCV |